; domain
(define (domain satellite-typed)
(:requirements :equality :strips :typing)
(:types satellite
        direction
        instrument
        mode)
(:predicates
 (on_board ?i - instrument ?s - satellite)
 (supports ?i - instrument ?m - mode)
 (pointing ?s - satellite ?d - direction)
 (power_avail ?s - satellite)
 (power_on ?i - instrument)
 (calibrated ?i - instrument)
 (have_image ?d - direction ?m - mode)
 (calibration_target ?i - instrument ?d - direction))

(:action turn_to
 :parameters ( ?s - satellite ?d_new ?d_prev - direction)
 :precondition
 (and
      (pointing ?s ?d_prev)
      )
 :effect
 (and (pointing ?s ?d_new)
      (not (pointing ?s ?d_prev))))

(:action switch_on
 :parameters (?i - instrument ?s - satellite)
 :precondition
 (and (on_board ?i ?s)
      (power_avail ?s))
 :effect
 (and (power_on ?i)
      (not (calibrated ?i))
      (not (power_avail ?s))))

(:action switch_off
 :parameters (?i - instrument ?s - satellite)
 :precondition
	(and (on_board ?i ?s)
             (power_on ?i))
 :effect
	(and (power_avail ?s)
             (not (power_on ?i))))

(:action calibrate
 :parameters (?i - instrument ?s - satellite ?d - direction)
 :precondition
	(and (on_board ?i ?s)
             (calibration_target ?i ?d)
             (pointing ?s ?d)
             (power_on ?i))
 :effect
	 (calibrated ?i))

(:action take_image
 :parameters (?i - instrument ?s - satellite ?d - direction ?m - mode)
 :precondition
	(and (calibrated ?i)
             (on_board ?i ?s)
             (supports ?i ?m)
             (power_on ?i)
             (pointing ?s ?d))
 :effect
	 (have_image ?d ?m))

)

; problem
(DEFINE (PROBLEM SATELLITE-TYPED-2) (:DOMAIN SATELLITE-TYPED)
 (:OBJECTS STAR7 - DIRECTION PHENOMENON6 - DIRECTION PHENOMENON5 - DIRECTION
  PLANET4 - DIRECTION PLANET3 - DIRECTION GROUNDSTATION2 - DIRECTION STAR0 -
  DIRECTION GROUNDSTATION1 - DIRECTION IMAGE2 - MODE INFRARED1 - MODE INFRARED0
  - MODE INSTRUMENT1 - INSTRUMENT INSTRUMENT0 - INSTRUMENT SATELLITE0 -
  SATELLITE)
 (:INIT (POINTING SATELLITE0 PLANET4) (POWER_AVAIL SATELLITE0)
  (ON_BOARD INSTRUMENT1 SATELLITE0) (ON_BOARD INSTRUMENT0 SATELLITE0)
  (CALIBRATION_TARGET INSTRUMENT1 GROUNDSTATION2)
  (SUPPORTS INSTRUMENT1 INFRARED0) (SUPPORTS INSTRUMENT1 INFRARED1)
  (SUPPORTS INSTRUMENT1 IMAGE2) (CALIBRATION_TARGET INSTRUMENT0 STAR0)
  (SUPPORTS INSTRUMENT0 INFRARED0) (SUPPORTS INSTRUMENT0 INFRARED1))
 (:GOAL
  (AND (HAVE_IMAGE PLANET3 INFRARED0) (HAVE_IMAGE PLANET4 INFRARED0)
       (HAVE_IMAGE PHENOMENON5 IMAGE2) (HAVE_IMAGE PHENOMENON6 INFRARED0)
       (HAVE_IMAGE STAR7 INFRARED0))))

; plan
1. (switch_on instrument1 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument1)
   goals met: 0 of 5
2. (turn_to satellite0 groundstation2 planet4)
   deleted: (pointing satellite0 planet4)
   added: (pointing satellite0 groundstation2)
   goals met: 0 of 5
3. (calibrate instrument1 satellite0 groundstation2)
   added: (calibrated instrument1)
   goals met: 0 of 5
4. (turn_to satellite0 phenomenon5 groundstation2)
   deleted: (pointing satellite0 groundstation2)
   added: (pointing satellite0 phenomenon5)
   goals met: 0 of 5
5. (take_image instrument1 satellite0 phenomenon5 image2)
   added: (have_image phenomenon5 image2)
   goals met: 1 of 5
6. (turn_to satellite0 star7 phenomenon5)
   deleted: (pointing satellite0 phenomenon5)
   added: (pointing satellite0 star7)
   goals met: 1 of 5
7. (take_image instrument1 satellite0 star7 infrared0)
   added: (have_image star7 infrared0)
   goals met: 2 of 5
8. (turn_to satellite0 planet4 star7)
   deleted: (pointing satellite0 star7)
   added: (pointing satellite0 planet4)
   goals met: 2 of 5
9. (take_image instrument1 satellite0 planet4 infrared0)
   added: (have_image planet4 infrared0)
   goals met: 3 of 5
10. (turn_to satellite0 planet3 planet4)
   deleted: (pointing satellite0 planet4)
   added: (pointing satellite0 planet3)
   goals met: 3 of 5
11. (take_image instrument1 satellite0 planet3 infrared0)
   added: (have_image planet3 infrared0)
   goals met: 4 of 5
12. (turn_to satellite0 phenomenon6 planet3)
   deleted: (pointing satellite0 planet3)
   added: (pointing satellite0 phenomenon6)
   goals met: 4 of 5
13. (take_image instrument1 satellite0 phenomenon6 infrared0)
   added: (have_image phenomenon6 infrared0)
   goals met: 5 of 5
